package me.zohar.lottery.common.exception;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 错误代码枚举类
 * @author zohar
 * @date 2019年1月7日
 *
 */
@Getter
@AllArgsConstructor
public enum BizErrorCode {

	参数异常("1000", "参数异常"),
	
	休市中("1001", "休市中"),
	
	投注期号不对("1002", "输入的期号与当前时间的期号对不上"),
	
	已截止投注("1003", "已截止投注"),
	
	余额不足("1006", "余额不足"),
	
	游戏玩法不存在("1012", "游戏玩法不存在"),
	
	游戏玩法被禁用("1012", "游戏玩法被禁用"),
	
	玩法赔率异常("1013", "玩法赔率异常"),
	
	用户名已存在("1014", "用户名已存在"),
	
	无权查看投注记录("1015", "无权查看投注记录"),
	
	旧的登录密码不正确("1016", "旧的登录密码不正确"),
	
	旧的资金密码不正确("1017", "旧的资金密码不正确"),
	
	签名不正确("1018", "签名不正确"),
	
	充值订单不存在("1019", "充值订单不存在"),
	
	充值金额对不上("1020", "充值金额对不上"),
	
	发起支付异常("1021", "发起支付异常"),
	
	游戏玩法代码已存在("1013", "游戏玩法代码已存在"),
	
	游戏代码已存在("1014", "游戏代码已存在"),
	
	期号设置已存在("1014", "期号设置已存在"),
	
	该期已开奖("1014", "该期已开奖,不能重复开奖"),
	
	开奖后才能结算("1014", "必须开奖后才能结算");
	
	private String code;

	private String msg;

}
